# 개발 문화 비유 {#devculture-tropes}

여기서 개발문화가 프로그래머문화만을 이야기하지 않는다는 걸 명심하자.

디지털 제품을 만드는데 있어 프로그래머, 디자이너, 기획자, 관리자 등등의 제품 개발에 참여하는 모든 직군에 공통될만한 문화에 대한 비유들을 정리한다. 

## 죽음의 행군 {#deathmarch}
Death march

건강이나 생명을 돌아가 보지 않는 행군. 이것에 참가하는 것은 많은 경우 죄수나 포로이며, 자주 다수의 사망자를 낸다.

## 개밥 먹기 {#dogfooding}
Dogfooding

## 데모 귀신 {#demo-ghost}
그렇게 테스트를 해봐도, 아무리 [스스로 오래 많이 사용](#dogfooding)해보아도 안나오던 버그들이 데모때 나오기도 한다.

## 숟가락 얹기 {#숟가락얹기}
이른바 협력의 딜레마.

## 들소 털깎기 {#yak-shaving}
나무를 해야 하는데, 집에있는 도끼의 날이 무뎌져서, 도끼날을 갈 돌을 구해야 하는데, 멀리 동쪽 바닷가에 있는 돌이 좋아서, 돌을 구하러 가야 하는데 동쪽 바닷가에 가려면 개썰매가 필요한데, 개썰매를 만들려면, ..., 이런 재귀적 과정을 반복하다가 결국 들소털을 깎아야 한다 까지 도달하고 마는 종류의 현상을 일컫는 표현이다. 원래는 의미없어보이는 활동이지만, 실제로는 꼭 필요한 작업이라는 뜻

많은 프로그래밍 혁신은 "yak shaving" 의 결과로 나타난다. 유닉스의 경우도 다소 단순화시켜 이야기하자면 벨 연구소의 켄 톰슨이 "Space Travel" 게임을 계속 하려고 PDP-7 로 포팅하다가 만들게된 측면이 있다.

